In [15]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [16]:
df=pd.read_csv('homeprices.csv')
df.head(4)

              town  area   price
0  monroe township  2600  550000
1  monroe township  3000  565000
2  monroe township  3200  610000
3  monroe township  3600  680000

In [17]:
dummies=pd.get_dummies(df.town)
dummies

    monroe township  robinsville  west windsor
0                 1            0             0
1                 1            0             0
2                 1            0             0
3                 1            0             0
4                 1            0             0
5                 0            0             1
6                 0            0             1
7                 0            0             1
8                 0            0             1
9                 0            1             0
10                0            1             0
11                0            1             0
12                0            1             0

In [18]:
df=pd.concat([df,dummies],axis='columns')
df.head()

              town  area   price  monroe township  robinsville  west windsor
0  monroe township  2600  550000                1            0             0
1  monroe township  3000  565000                1            0             0
2  monroe township  3200  610000                1            0             0
3  monroe township  3600  680000                1            0             0
4  monroe township  4000  725000                1            0             0

In [19]:
df=df.drop(['town','west windsor'],axis='columns')
df.head(5)

   area   price  monroe township  robinsville
0  2600  550000                1            0
1  3000  565000                1            0
2  3200  610000                1            0
3  3600  680000                1            0
4  4000  725000                1            0

In [20]:
X=df.drop(['price'],axis='columns')
y=df.price

In [21]:
X

    area  monroe township  robinsville
0   2600                1            0
1   3000                1            0
2   3200                1            0
3   3600                1            0
4   4000                1            0
5   2600                0            0
6   2800                0            0
7   3300                0            0
8   3600                0            0
9   2600                0            1
10  2900                0            1
11  3100                0            1
12  3600                0            1

In [22]:
y

0     550000
1     565000
2     610000
3     680000
4     725000
5     585000
6     615000
7     650000
8     710000
9     575000
10    600000
11    620000
12    695000
Name: price, dtype: int64

In [30]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=0)

In [26]:
x_train

    area  monroe township  robinsville
10  2900                0            1
2   3200                1            0
8   3600                0            0
1   3000                1            0
7   3300                0            0
9   2600                0            1
3   3600                1            0
0   2600                1            0
5   2600                0            0
12  3600                0            1

In [29]:
y_test

6     615000
11    620000
4     725000
Name: price, dtype: int64

In [31]:
model=linear_model.LinearRegression()
model.fit(x_train,y_train)

LinearRegression()

In [32]:
model.predict([[2600,0,1]])

array([569074.85875707])

In [33]:
model.predict(x_test)

array([602422.31638418, 631680.79096045, 713940.67796609])

In [34]:
y_test

6     615000
11    620000
4     725000
Name: price, dtype: int64